modm-ext/data.modm.io/docs/svd/header_stm32l475xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC2</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x50040100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC3</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x50040200</baseAddress>
      <interrupt>
        <name>ADC3</name>
        <description>ADC3 global Interrupt</description>
        <value>47</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC123_COMMON</name>
      <baseAddress>0x50040300</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>ADC common status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADRDY_MST</name>
              <description>ADC multimode master ready flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOSMP_MST</name>
              <description>ADC multimode master group regular end of sampling flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC_MST</name>
              <description>ADC multimode master group regular end of unitary conversion flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOS_MST</name>
              <description>ADC multimode master group regular end of sequence conversions flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_MST</name>
              <description>ADC multimode master group regular overrun flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOC_MST</name>
              <description>ADC multimode master group injected end of unitary conversion flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOS_MST</name>
              <description>ADC multimode master group injected end of sequence conversions flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD1_MST</name>
              <description>ADC multimode master analog watchdog 1 flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD2_MST</name>
              <description>ADC multimode master analog watchdog 2 flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD3_MST</name>
              <description>ADC multimode master analog watchdog 3 flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JQOVF_MST</name>
              <description>ADC multimode master group injected contexts queue overflow flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADRDY_SLV</name>
              <description>ADC multimode slave ready flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOSMP_SLV</name>
              <description>ADC multimode slave group regular end of sampling flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC_SLV</name>
              <description>ADC multimode slave group regular end of unitary conversion flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOS_SLV</name>
              <description>ADC multimode slave group regular end of sequence conversions flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_SLV</name>
              <description>ADC multimode slave group regular overrun flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOC_SLV</name>
              <description>ADC multimode slave group injected end of unitary conversion flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOS_SLV</name>
              <description>ADC multimode slave group injected end of sequence conversions flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD1_SLV</name>
              <description>ADC multimode slave analog watchdog 1 flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD2_SLV</name>
              <description>ADC multimode slave analog watchdog 2 flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD3_SLV</name>
              <description>ADC multimode slave analog watchdog 3 flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JQOVF_SLV</name>
              <description>ADC multimode slave group injected contexts queue overflow flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>ADC common configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUAL</name>
              <description>ADC multimode mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INDEPENDENT</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_SIMULT</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_INTERL</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_INJ_SIMULT</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_INJ_ALTERN</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_SIM_INJ_SIM</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_SIM_INJ_ALT</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_INT_INJ_SIM</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DELAY</name>
              <description>ADC multimode delay between 2 sampling phases</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAY_1CYCLE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_2CYCLES</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_3CYCLES</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_4CYCLES</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_5CYCLES</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_6CYCLES</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_7CYCLES</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_8CYCLES</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_9CYCLES</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_10CYCLES</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_11CYCLES</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_12CYCLES</name>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMACFG</name>
              <description>ADC multimode DMA transfer configuration</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MDMA</name>
              <description>ADC multimode DMA transfer enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKMODE</name>
              <description>ADC common clock source and prescaler (prescaler only for clock source synchronous)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRESC</name>
              <description>ADC common clock prescaler, only for clock source asynchronous</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VREFEN</name>
              <description>ADC internal path to VrefInt enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSEN</name>
              <description>ADC internal path to temperature sensor enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATEN</name>
              <description>ADC internal path to battery voltage enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <description>ADC common group regular data register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDATA_MST</name>
              <description>ADC multimode master group regular conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RDATA_SLV</name>
              <description>ADC multimode slave group regular conversion data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
